src/app/models/advert.rb

INSERT INTO "adverts" ("book_id", "seller_id", "price", "condition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["book_id", 1], ["seller_id", 1], ["price", "123.0"], ["condition", "Brand New"], ["created_at", "2019-08-06 09:19:56.416652"], ["updated_at", "2019-08-06 09:19:56.416652"]]
INSERT INTO "adverts" ("book_id", "seller_id", "price", "condition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["book_id", 1], ["seller_id", 1], ["price", "20.0"], ["condition", "Very Good"], ["created_at", "2019-08-06 03:49:30.856918"], ["updated_at", "2019-08-06 03:49:30.856918"]]
---
  def self.create_advert(book_id, price, condition, seller_id)
      advert = Advert.new(book_id: book_id, price: price, condition: condition, seller_id: seller_id)
      advert.save!