src/app/controllers/orders_controller.rb

    def new
        @order = Order.new
        @advert = Advert.find(params[:advert_id])
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 199], ["LIMIT", 1]]