app/controllers/adverts_controller.rb

  def index
    @adverts = Advert.order_by_created
---
SELECT "adverts".* FROM "adverts" ORDER BY "adverts"."created_at" DESC

  def new
    @advert = Advert.new
    @current_book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @advert = Advert.create_advert(params[:advert][:book_id], params[:advert][:price], params[:advert][:condition], params[:advert][:seller_id])
---
INSERT INTO "adverts" ("book_id", "seller_id", "price", "condition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["book_id", 1], ["seller_id", 1], ["price", "20.0"], ["condition", "Very Good"], ["created_at", "2019-08-06 03:49:30.856918"], ["updated_at", "2019-08-06 03:49:30.856918"]]

  def show
    @advert = Advert.find(params[:id])
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @advert = Advert.find(Advert.advert_id(current_user,params[:id]))
---
SELECT  "adverts".* FROM "adverts" WHERE "adverts"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]

  def destroy
    advert_id = params[:id]
    Advert.destroy(advert_id)
---
DELETE FROM "adverts" WHERE "adverts"."id" = $1  [["id", 78]]