app/models/book.rb

INSERT INTO "books" ("isbn", "title", "created_at", "updated_at", "description", "image_link", "authors") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def self.select_book(title)
        books = GoogleBooks.search(title)
        book = books.first
        new_book = Book.new
        new_book.title = book.title
        new_book.isbn = book.isbn
        new_book.authors = book.authors
        new_book.description = book.description
        new_book.image_link = book.image_link
        new_book.save